Repository: yoko-at-home/reactjs-docs-TM
Catalog: docs/addons-shallow-renderer_EN-US_ja.tmx
Source language: en_us
Languages: ja

source: **Importing**
ja: **インポート**

source: ## Overview {#overview}
ja: ## 概要 {#overview}

source: When writing unit tests for React, shallow rendering can be helpful.
ja: React の単体テストを実装するとき、Shallow Renderer が役立つでしょう。

source: Shallow rendering lets you render a component "one level deep" and assert facts about what its render method returns, without worrying about the behavior of child components, which are not instantiated or rendered.
ja: 浅いレンダー (shallow rendering) を使用すると、インスタンス化またはレンダーされていない子コンポーネントの振る舞いを心配することなく、「1 階層深く」レンダーしてレンダーメソッドが返すものを assert できます。

source: This does not require a DOM.
ja: これに DOM は必要ありません。

source: For example, if you have the following component:
ja: たとえば、以下のコンポーネントがある場合：

source: Then you can assert:
ja: 以下のように assert できます：

source: Shallow testing currently has some limitations, namely not supporting refs.
ja: 浅いレンダーによるテストには現在いくつかの制限があります。すなわち ref をサポートしていません。

source: > Note: > > We also recommend checking out Enzyme's [Shallow Rendering API](https://airbnb.io/enzyme/docs/api/shallow.html).
ja: > 補足： > > また Enzyme の [Shallow Rendering API](https://airbnb.io/enzyme/docs/api/shallow.html) をチェックすることをお勧めします。

source: It provides a nicer higher-level API over the same functionality.
ja: それは同じ機能上でより良くより高いレベルの API を提供します。

source: ## Reference {#reference}
ja: ## リファレンス {#reference}

source: You can think of the shallowRenderer as a "place" to render the component you're testing, and from which you can extract the component's output.
ja: shallowRenderer は、テストしているコンポーネントをレンダーするための「場所」と捉えることができ、そこからコンポーネントの出力を抽出できます。

source: `shallowRenderer.render()` is similar to [`ReactDOM.render()`](/docs/react-dom.html#render) but it doesn't require DOM and only renders a single level deep.
ja: `shallowRenderer.render()` は [`ReactDOM.render()`](/docs/react-dom.html#render) に似ていますが、DOM を必要とせず、1 階層だけレンダーします。

source: This means you can test components isolated from how their children are implemented.
ja: つまり、テスト対象のコンポーネントが持つ子コンポーネントの実装から分離してテストを実行できます。

source: After `shallowRenderer.render()` has been called, you can use `shallowRenderer.getRenderOutput()` to get the shallowly rendered output.
ja: `shallowRenderer.render()` が呼び出された後、`shallowRenderer.getRenderOutput()` を使用して浅くレンダーされた出力を取得できます。

source: You can then begin to assert facts about the output.
ja: そして出力から得た結果の assert を開始できます。
